first_room=input("Введите номер первой комнаты: ")
second_room=input("Введите номер второй комнаты: ")
print('-----------------------------------------------------')
print('До преобразований')
print(f'Первая комната: {first_room}')
print(f'Вторая комната: {second_room}')
a=''
a=second_room
second_room=first_room
first_room=a
print('-----------------------------------------------------')
print('После преобразований')
print(f'Первая комната: {first_room}')
print(f'Вторая комната: {second_room}')
print('-----------------------------------------------------')
