f_object=input("Введите название первого предмета: ")
c1=int(input(f'Введите колличество занятий по предмету {f_object} за неделю(Целое неотрицательное число): '))
time1=int(input(f'Введите продолжительность одного занятия по предмету {f_object} в минутах(Положительное целое число): '))
alltime1=time1*c1
s_object=input("Введите название второго предмета: ")
c2=int(input(f'Введите колличество занятий по предмету {s_object} за неделю(Целое неотрицательное число): '))
time2=int(input(f'Введите продолжительность одного занятия по предмету {s_object} в минутах(Положительное целое число): '))
alltime2=time2*c2
freetime=int(input('Введите доступное время на неделю в часах: '))
if ((freetime)*60>=alltime1+alltime2) and (c1>=0 and c2>=0) and (time1>=1 and time2>=1):
    print('----------------------------------------------------------------')
    print(f'Время на предмет - {f_object}: {alltime1}')
    print(f'Время на предмет - {s_object}: {alltime2}')
    print(f'Общая нагрузка по предметам {f_object} и {s_object} в минутах составляет: {alltime1+alltime2} минут, а в часах состовляет: {(alltime1+alltime2)/60:.2f} часа/ов')
    if (freetime)*60==alltime1+alltime2:
        print('К сожалению свободого времени не осталось!')
    else:
        print(f'Остаток свободного времени в часах составляет: {freetime-(alltime1+alltime2)/60:.2f} часа/ов')
    print(f'Общая нагрузка по предметам {f_object} и {s_object} за четыре одинаковых недели в минутах составляет: {(alltime1+alltime2)*4} минут, а в часах состовляет: {((alltime1+alltime2)/60)*4:.2f} часа/ов')
    print('----------------------------------------------------------------')
elif (freetime)*60<alltime1+alltime2:
    print('----------------------------------------------------------------')
    print('Свободного времени недостаточно для занятий')
    print(f'Вам нехватает {(alltime1+alltime2)-(freetime)*60} Минут.')
    print('----------------------------------------------------------------')